In [ ]:
#  월별 통신 이용시간의 합을 계산
#  월별 통화 시간의 합
# 아이템별 이용시간 합
#  월별 아이템별 이용건수
# 테이블 형식  하나의 인덱스를  column으로 뺌
# 연도만 뽑고 싶을때
# duration 소숫점 첫째자리 반올림
# duration을 정수로 바꾸기_

In [1]:
# EcommercePurchases
# 도메인 뽑기
# value_counts()
#  오전 구매건수와 오후 구매 건수를 계산하시오
#  고객들이 사용하는 브라우저 종류별 갯수를 출력하시오

In [ ]:
# Salaries1,csv 파일을 dataframe으로 읽으시오
# BasePay의 평균은 얼마인가?
# OverTimepay의 최대값은?
# 'JOSEPH DRISCOLL' 의 JOB TITLE은?
# TotalPayBeneift의 최고금액을 수령하는 사람의 이름은?
# BasePay의 연도별 평균금액은?
# JobTitle에서 가장 많은 Job 상위 5개?
# 2011년도에 오직 한 사람만이 수행하는 job의 갯수는?
# 'Chief'라는 직업을 가진 사람의 수

In [ ]:
# seoul_weather.csv 불러오기
# 전처리
# 역대 최고기온인 날의 날짜는?
# 일교차가 가장 큰 월은 언제인가?
# 월교차가 가장 큰 연도는?
# 8월의 최고기온을 추출해서 라인그래프로 그리시오
# 매년 8월 중에 최고기온 하나를 뽑아서 라인 차트로 그리시오 
# 지구온난화 여부확인을 위해 매년 평균기온의 line차트를 그리시오 
# 1~12월 사이 각 월의 일평균기온의 bax chart를 그리시오

In [2]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings(action='ignore')

import matplotlib as mpl
import matplotlib.font_manager as fm

mpl.rcParams['axes.unicode_minus'] = False

path = 'C:/Windows/Fonts/malgun.ttf'
font_name = fm.FontProperties(fname=path, size=50).get_name()
plt.rc('font', family=font_name)

In [9]:
tt = pd.read_csv('./data_study/phone_data.csv', index_col=0) 
tt.head()

                 date  duration  item    month   network network_type
index
0      15/10/14 06:58    34.429  data  2014-11      data         data
1      15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2      15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3      15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4      15/10/14 17:27     4.000  call  2014-11     Tesco       mobile

In [10]:
#  월별 통신 이용시간의 합을 계산
tt.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [16]:
#  월별 통화 시간의 합
tt.groupby('item')['duration'].sum()['call']

month    item
2014-11  False     1092.441
         True     25547.000
2014-12  False     1080.870
         True     13561.000
2015-01  False     1153.299
         True     17070.000
2015-02  False     1106.299
         True     14416.000
2015-03  False     1023.441
         True     21727.000
Name: duration, dtype: float64

In [22]:
# 아이템별 이용시간 합
tt.groupby('item')['duration'].sum()

item
call    92321.00
data     5164.35
sms       292.00
Name: duration, dtype: float64

In [23]:
#  월별 아이템별 이용건수
tt.groupby('month')['item'].value_counts()

month    item
2014-11  call    107
         sms      94
         data     29
2014-12  call     79
         sms      48
         data     30
2015-01  call     88
         sms      86
         data     31
2015-02  call     67
         sms      39
         data     31
2015-03  call     47
         data     29
         sms      25
Name: item, dtype: int64

In [25]:
# 테이블 형식  하나의 인덱스를  column으로 뺌
tt.groupby(['month','item'])['duration'].count().unstack()

item     call  data  sms
month
2014-11   107    29   94
2014-12    79    30   48
2015-01    88    31   86
2015-02    67    31   39
2015-03    47    29   25

In [30]:
# 연도만 뽑고 싶을때
tt['month']= pd.to_datetime(tt['month'])

In [32]:
tt['year']=tt['month'].dt.year

In [34]:
tt['year']

index
0      2014
1      2014
2      2014
3      2014
4      2014
       ...
825    2015
826    2015
827    2015
828    2015
829    2015
Name: year, Length: 830, dtype: int64

In [36]:
# duration 소숫점 첫째자리 반올림
tt['duration'].round()

index
0      34.0
1      13.0
2      23.0
3       4.0
4       4.0
       ...
825     1.0
826     1.0
827    34.0
828     1.0
829     1.0
Name: duration, Length: 830, dtype: float64

In [37]:
# duration을 정수로 바꾸기_
tt['duration'].astype('int')

index
0      34
1      13
2      23
3       4
4       4
       ..
825     1
826     1
827    34
828     1
829     1
Name: duration, Length: 830, dtype: int32

In [64]:
# Salaries1,csv 파일을 dataframe으로 읽으시오
d = pd.read_csv('./data_study/Salaries.csv')
dd = pd.DataFrame(d)
dd.head()

,Unnamed: 0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [44]:
# BasePay의 평균은 얼마인가?
dd['BasePay'].mean()

75601.13714620461

In [45]:
# OverTimepay의 최대값은?
dd['OvertimePay'].max()

245131.88

In [58]:
# 'JOSEPH DRISCOLL' 의 JOB TITLE은?
dd[dd['EmployeeName']=='JOSEPH DRISCOLL'],'JobTitle'

(    Unnamed: 0  Id     EmployeeName                   JobTitle    BasePay  \
 24          24  25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  140546.86

     OvertimePay  OtherPay  Benefits   TotalPay  TotalPayBenefits  Year  Notes  \
 24     97868.77  31909.28       NaN  270324.91         270324.91  2011    NaN

            Agency  Status
 24  San Francisco     NaN  ,
 'JobTitle')

In [83]:
# TotalPayBeneift의 최고금액을 수령하는 사람의 이름은?
dd.groupby('EmployeeName')['TotalPayBenefits'].max().sort_values(ascending=False).head(1)

EmployeeName
NATHANIEL FORD    567595.43
Name: TotalPayBenefits, dtype: float64

In [85]:
# BasePay의 연도별 평균금액은?
dd.groupby('Year')['BasePay'].mean()

Year
2011     63595.956517
2012    106964.140280
Name: BasePay, dtype: float64

In [87]:
# JobTitle에서 가장 많은 Job 상위 5개?
dd['JobTitle'].value_counts().head(5)

TRANSIT OPERATOR    2388
SPECIAL NURSE       1402
REGISTERED NURSE    1219
Registered Nurse    1003
CUSTODIAN            796
Name: JobTitle, dtype: int64

In [94]:
# 2011년도에 오직 한 사람만이 수행하는 job의 갯수는?
sum(dd[dd['Year']==2011]['JobTitle'].value_counts()==1)

200

In [105]:
# 'Chief'라는 직업을 가진 사람의 수
sum(dd['JobTitle'].apply(lambda x:'chief' in x.lower()))

318